server/app/controllers/event_controller.rb

SELECT * FROM "players"
SELECT * FROM "bullets"
---
  def index
    @players = Player.all
    @bullets = Bullet.all

SELECT * FROM "players" WHERE ("players"."id" = 1)
UPDATE "players" SET "updated_at" = '2010-09-11 12:32:34', "y" = 5.0, "x" = 3.0, "heading" = 2.0, "hp" = 90, "speed" = 3.0 WHERE "id" = 1
---
  def update_player_position
    @player = Player.find(params[:player_id])
    if params[:x] and params[:y]
      @player.x = params[:x]
      @player.y = params[:y]
      @player.heading = params[:heading]
      @player.hp = params[:hp]
      @player.speed = params[:speed]

      @player.save

SELECT * FROM "bullets" WHERE ("bullets"."id" = 1)
UPDATE "bullets" SET "updated_at" = '2010-09-11 12:24:57', "heading" = 42.0, "hp" = 90, "speed" = 33.0 WHERE "id" = 1
---
  def update_bullet_position
    @bullet = Bullet.find(params[:bullet_id])
    if params[:x] and params[:y]
      @bullet.x = params[:x]
      @bullet.y = params[:y]
      @bullet.heading = params[:heading]
      @bullet.hp = params[:hp]
      @bullet.speed = params[:speed]
      @bullet.save